trialWicking/verification/BL_grav_BC_FFP/port/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    location        "86";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    leftWall
    {
        type            fixedValue;
        value           uniform ( 1e-05 0 0 );
    }
    rightWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
